<a href="https://colab.research.google.com/github/nirmalaraj77/SQL/blob/main/SQL_Notes_DataCamp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**NOTE**

ALTER TABLE books. 
ALTER COLUMN date_text SET DATA TYPE date. 
      USING to_date(date_text, 'mm-dd-yyyy');

#**SQL DATABASES**
### - Must have Schema
### - Gives Result Set
### - SQL Tables must have a Unique Identifier

#**SQL Style Guide**
### - New lines, Capitalisation and Indentation not required
### - Use Holywell's guide
### - Capitalise Keywords
### - Underscore filed names
### - if no underscore, use inverted commas

#**Debugging SQL**
### - Code not pocessed in written order
### - Misspelling
### - Incorrect capitalisation
### - Incorrect or missing punctuation, comma errors

#**SQL Execution Order**

### - Written Code
SELECT


FROM 

WHERE

LIMIT

### - Execution Order
FROM

WHERE

SELECT (alias defined here)

LIMIT

#**SQL DATA TYPES**
### - VARCHAR
### - INT
### - FLOAT
### - NUMERIC

#**PostgreSQL**
### - Free, refers to database system and and associated SQL flavour

SELECT id, name

FROM employees

**LIMIT** 2;

#**SQL Server**
### - Paid and free, Microsoft T-SQL flavour

SELECT id, name

FROM employees

**TOP** 2;

#**SQL QUERY KEYWORDS**

##**SELECT**
##**SELECT * (SELECT ALL)**
##**SELECT AS (aliasing) E.g. SELECT author AS unique_author**
##**FROM**
##**LIMIT**

### - E.g. 
SELECT author AS uniquue_author  
FROM books  
LIMIT 20;

#**DISTINCT (combines data into unique values in a field)**
### - Use DISTINCT on multiple fields by writing DISTINCT once - then list the fields afterward

### - E.g. 
SELECT DISTINCT author  
FROM books;

### - E.g. 
SELECT DISTINCT author, genre  
FROM books;

#**VIEW**
### - CREATE VIEW AS (virtual table - stores query code)
### - View is a virual table that is the result of a saved SQL SELECT statement
### - Views update sutomatically
### - No result set when creating a view
### - Query view (same as table) by selecting FROM the view

### - E.g. Create View
CREATE VIEW employee_hire_years AS  
SELECT id, name, year_hired  
FROM employees; 


### - E.g. Query View
SELECT id, name  
FROM employee_hire_years;

#**COUNT( )**
### - Returns the no. of records with a value in a field
### - Can use ALIAS to make result more readable
### - Can use with multiple fields
### - Count (*) counts records in a table

### - E.g. 
SELECT COUNT (birthdate) AS count_birthdates

FROM people;

### - E.g. 
SELECT COUNT (name) AS count_names, COUNT (birthdate) AS count_birthdates  
FROM people;

### - E.g. 
SELECT COUNT (*) AS total_records  
FROM people;

#**Combine COUNT, DISTINCT to count unique values**

### - E.g. 

SELECT COUNT (DISTINCT bithdate) AS count_disctinct_birthdates  
FROM people;

#**WHERE**
### - Filter SQL Query
### - Use Comparision operators >, >=, <, <=, =, <>

### - E.g. 
SELECT title  
FROM films  
WHERE release_year > 1960;


### - Use = for specific (equal to)

### - E.g. 
SELECT title  
FROM films  
WHERE release_year = 1960;


### - Use <> for except specific (not equal to)

### - E.g. 
SELECT title  
FROM films  
WHERE release_year <> 1960;


### - Use '  ' for Strings 

### - E.g. 

SELECT title, country  
FROM films  
WHERE country = 'Japan';

#**Combine COUNT, WHERE to count unique values**
### - E.g. 

SELECT COUNT (num_votes) AS films_over_1000K_votes  
FROM reviews  
WHERE num_votes > 100000;


### - E.g. 
SELECT COUNT (language) AS count_spanish  
FROM films  
WHERE language = 'Spanish'

#**MULTIPLE CRITERA KEYWORDS**
##**OR**
### - E.g.
SELECT *

FROM coats

WHERE color = 'yellow' OR colour = 'red';
##**AND**
### - E.g. 
SELECT *  
FROM coats  
WHERE color = 'yellow' AND colour = 'red';

### - E.g. 
SELECT *  
FROM films  
WHERE (language = 'German') AND (release_year > 2000 AND release_year < 2010);



##**Combine AND, OR**
SELECT title  
FROM films  
WHERE (release_year = 1994 OR release_year = 1995) AND (certification = 'PG' OR certification = 'R') ;

##**Combine BETWEEN, AND**
### - Between is inclusive
SELECT title  
FROM films  
WHERE release_year BETWEEN 1994 AND 2000 ;


##**Combine BETWEEN, AND, OR**
### - Between is inclusive
SELECT title  
FROM films  
WHERE release_year  
BETWEEN 1994 AND 2000 AND country ='UK' ;

##**Combine WHERE, AND, OR, BETWEEN**
### - E.g.
SELECT title, release_year  
FROM films  
WHERE (release_year = 1990 OR release_year = 1999)  
AND (language = 'English' OR language = 'Spanish')  
AND gross > 2000000; 


### - E.g.
SELECT title, release_year  
FROM films  
WHERE (release_year BETWEEN 1990 AND 2000)
AND budget > 100000000  
AND (language = 'Spanish' OR language = 'French');

##**IN**
### - Combine WHERE,OR

### - E.g. (with many OR keywords)
SELECT title  
FROM films  
WHERE release_year = 1920
OR release_year = 1930
OR release_year = 1940 ;


### - E.g. (combine many OR keywords using IN)
SELECT title  
FROM films  
WHERE release_year IN (1920, 1930, 1940)

#**FILTERING TEXT KEYWORDS**
### - Filter pattern rather than specific text string
### - Use wildcard as a placeholder
### - Case 
### - Can position wildcard anywhere
### - Can use combined


##**LIKE**

###**% match 0, 1 or many characters**

### - E.g. 
SELECT name  
FROM people  
WHERE name LIKE 'Ade%';  


###**_ match single characters** 

### - E.g. 
SELECT name  
FROM people  
WHERE name LIKE 'Ev_';

### - E.g. (find names with third character 't')
SELECT name  
FROM people  
WHERE name LIKE '__t%'


##**NOT LIKE**
### - E.g. (find names with third character not 't')
SELECT name  
FROM people  
WHERE name NOT LIKE '__t%'
 

### - E.g. 
SELECT name  
FROM people  
WHERE name NOT LIKE 'A.%' ;

#**EXERCISE**
Count the unique titles from the films database and use the alias provided.  
Filter to include only movies with a release_year from 1990 to 1999, inclusive.  
Add another filter narrowing your query down to English-language films.  
Add a final filter to select only films with 'G', 'PG', 'PG-13' certifications.  

<br>

-- Count the unique titles  
SELECT COUNT (DISTINCT title) AS nineties_english_films_for_teens  
FROM films  
-- Filter to release_years to between 1990 and 1999  
WHERE (release_year BETWEEN 1990 AND 1999)  
-- Filter to English-language films  
AND language = 'English'  
-- Narrow it down to G, PG, and PG-13 certifications  
AND (certification IN ('G', 'PG', 'PG-13'));

#**NULL VALUES**
##**null represents a missing or unknown value**

##COUNT (field_name) - includes only non-missing values
##COUNT (*) - includes missing values

##**IS NULL**
### - E.g. 
SELECT name  
FROM people  
WHERE birthdate IS NULL ;  

### - E.g. 
SELECT COUNT (*) AS no_birthdates    
FROM people  
WHERE birthdate IS NULL ;  

##**IS NOT NULL**
### - E.g. 
SELECT COUNT (*) AS count_bithdates   
FROM people  
WHERE birthdate IS NOT NULL ;  

##**COUNT () vs IS NOT NULL gives same results as both count non-missing values**

### - E.g. (COUNT)
SELECT COUNT (certification)  
AS count_certification    
FROM films :

### - E.g. (using IS NOT NULL with WHERE clause)
SELECT COUNT (certification)  
AS count_certification  
FROM films  
WHERE certification IS NOT NULL ;

#**AGGREGATE FUNCTIONS**
### - Data summarised with function name ON COLUMNS
### - Use Aliasing

##**AVG ( )**

##**SUM ( )**

##**MIN ( )**

##**MAX ( )**

##**COUNT ( )**

### - E.g. (Mathematical)
SELECT SUM (budget)  
FROM films ;

### - E.g. (non-Mathematical)
SELECT MIN (country)  
FROM films ;

#**USE WHERE WITH AGGREGATE FUNCTIONS**

### - E.g. 
SELECT AVG (budget) AS avg_budget  
FROM films  
WHERE release_year >= 2000 ;

#**ROUND ( )**
### - Round has 2 parameters, number_to_round and decimal_places (optional - default 0)
### - Can use negative to round before decimal point

### - E.g.
SELECT ROUND (AVG (budget), 2) AS avg_budget  
FROM films  
WHERE release_year >= 2010;

#**ARITHMETIC and ALIASING**
### - Data calculated on Fields
### - Can Use Arithmetic Operators
### - Always use alias

### - E.g.
SELECT (1 + 1)  
SELECT (3 - 1)  
SELECT (3 * 4)  
SELECT (4 / 3 ) *answer is 1 (int)*  
SELECT (4.0 / 3.0) *use floats for precise answers*